week3/2-extend-the-blog/app/views/_post_list.html.erb

    <div class="panel-footer tags">
        <% post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 1]]