week3/2-extend-the-blog/app/controllers/home_controller.rb

  def index
    @posts = Post.all
    @tags = Tag.all
---
SELECT "posts".* FROM "posts"
SELECT "tags".* FROM "tags"