week3/2-extend-the-blog/app/controllers/photos_controller.rb

INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "test"], ["created_at", "2015-04-08 22:50:26.778391"], ["updated_at", "2015-04-08 22:50:26.778391"]]
INSERT INTO "photos" ("url") VALUES (?)  [["url", "http://www.zwani.com/graphics/hello_funny/images/10.gif"]]
UPDATE "posts" SET "data_id" = ?, "data_type" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["data_id", 2], ["data_type", "Photo"], ["updated_at", "2015-04-08 22:50:26.788484"], ["id", 7]]
---
  def create
    post = Post.create(post_params)
    photo = Photo.create(photo_params)
    post.update_attribute(:data, photo)