week3/2-extend-the-blog/app/controllers/posts_controller.rb

  def create
    post = Post.create(post_params)
    article = Article.create(article_params)
    post.update_attribute(:data, article)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test1"], ["content", "test2"], ["created_at", "2015-04-02 17:37:08.084758"], ["updated_at", "2015-04-02 17:37:08.084758"]]
INSERT INTO "articles" ("content") VALUES (?)  [["content", "article"]]
UPDATE "posts" SET "data_id" = ?, "data_type" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["data_id", 1], ["data_type", "Article"], ["updated_at", "2015-04-08 22:37:13.319713"], ["id", 2]]

  def destroy
    post = Post.find(params[:id])
    unless post.nil?
      post.data.delete
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]