week3/2-extend-the-blog/app/controllers/search_controller.rb

  def tag
    @tag = Tag.find_by(name: params[:tag])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT 1  [["name", "tag1"]]